public  class Main {

    //Создать класс УчебнаяГруппа содержащая в себе поля Преподаватель и список Студентов.
    //Создать класс УчебнаяГруппаСервис, в котором реализована функция(входные параметры - 
    //(Teacher, List<Student>)) формирования из Студентов и Преподавателя УчебнойГруппы и возвращения его.
    //Создать метод в Контроллере, в котором агрегируются функции получения списка студентов (их id) 
    //и преподавателя (его id) и формирования учебной группы, путем вызова метода из сервиса.
   
    public static void main(String[] args) {
        
    }

}